Repository: DuckBoss/subscription-manager
Catalog: syspurpose/po/*.po
Languages: de, ja, ru

source: usage:
ja: 使用方法:

source: .__call__() not defined
ja: .__call__() が定義されていません

source: unknown parser %(parser_name)r (choices: %(choices)s)
ja: 不明なパーサー %(parser_name)r (選択肢: %(choices)s)

source: argument "-" with mode %r
ja: %r モードでは引数 "-"

source: can't open '%s': %s
ja: '%s' を開くことができません: %s

source: cannot merge actions - two groups are named %r
ja: 動作をマージできません: 2 つのグループの名は、%r と命名されています

source: 'required' is an invalid argument for positionals
ja: 'required' は、位置引数の無効な引数です

source: invalid option string %(option)r: must start with a character %(prefix_chars)r
ja: 無効なオプション文字列 %(option)r: 文字 %(prefix_chars)r で始まる必要があります

source: dest= is required for options like %r
ja: dest= は、%r のようにオプションに必要です

source: invalid conflict_resolution value: %r
ja: 無効な conflict_resolution の値: %r

source: conflicting option string: %s
ja: 競合するオプションの文字列: %s

source: mutually exclusive arguments must be optional
ja: 相互排他的引数は任意です

source: positional arguments
ja: 位置引数

source: optional arguments
ja: オプションの引数

source: show this help message and exit
ja: ヘルプメッセージを表示して終了します

source: cannot have multiple subparser arguments
ja: 複数の subparser 引数を指定できません

source: unrecognized arguments: %s
ja: 認識されない引数: %s

source: not allowed with argument %s
ja: 引数 %s では許可されていません

source: ignored explicit argument %r
ja: 無視された明示的な引数 %r

source: the following arguments are required: %s
ja: 以下の引数は必須です: %s

source: one of the arguments %s is required
ja: 引数 %s のいずれかが必要です

source: expected one argument
ja: 1 つの引数が必要です

source: expected at most one argument
ja: 少なくとも 1 つの引数が必要です

source: expected at least one argument
ja: 少なくとも 1 つの引数が必要です

source: expected %s argument
ja: %s 引数が必要です

source: ambiguous option: %(option)s could match %(matches)s
ja: あいまいなオプション: %(option)s は %(matches)s に一致する可能性があります

source: unexpected option string: %s
ja: 予期せぬオプションの文字列: %s

source: %r is not callable
ja: %r は呼び出しできません

source: invalid %(type)s value: %(value)r
ja: 無効な %(type)s 値: %(value)r

source: invalid choice: %(value)r (choose from %(choices)s)
ja: 無効な選択: %(value)r (%(choices)s から選択)

source: %(prog)s: error: %(message)s
ja: %(prog)s: エラー: %(message)s

source: Warning: A {attr} of "{download_value}" was recently set for this system by the entitlement server administrator. {advice}
ja: 警告: "{download_value}" の {attr} は最近、エンタイトルメントサーバー管理者によってこのシステムに設定されました。 {advice}

source: If you'd like to overwrite the server side change please run: {command}
ja: サーバー側の変更を上書きする場合は、以下を実行します: {command}

source: Added "{value}" to {prop_name}.
ja: {value} を {prop_name} に追加しました。

source: Not adding value "{value}" to {prop_name}; it already exists.
ja: 値 {value} は {prop_name} に追加しません。すでに存在します。

source: {attr} updated.
ja: {attr} を更新しました。

source: Removed "{val}" from {name}.
ja: "{val}" を {name} から削除しました。

source: Not removing value "{val}" from {name}; it was not there.
ja: 値 "{val}" を {name} から削除しません。その値はそこにありませんでした。

source: {attr} set to "{val}".
ja: {attr} を "{val}" に設定しました。

source: {attr} unset.
ja: {attr} の設定を解除しました。

source: System Syspurpose Management Tool
ja: システム Syspurpose 管理ツール

source: The 'syspurpose' command is deprecated and will be removed in a future major release. Please use the 'subscription-manager syspurpose' command going forward.
ja: syspurpose コマンドは非推奨となり、今後のメジャーリリースで削除されます。今後は subscription-manager syspurpose コマンドを使用してください。

source: The value(s) to add
de: Der/die hinzuzufügende(n) Wert(e)
ja: 追加する値
ru: Значение (значения) для добавления

source: The value(s) to remove
de: Der/die zu entfernende(n) Wert(e)
ja: 削除する値
ru: Значение (ы) для удаления

source: The value to set
de: Der einzustellende Wert
ja: 設定する値
ru: Значение для установки

source: Sets the value for the given property
de: Legt den Wert für die angegebene Eigenschaft fest
ja: 指定プロパティーの値を設定
ru: Устанавливает значение для данного свойства

source: The name of the property to set/update
de: Der Name der einzurichtenden/aktualisierenden Eigenschaft
ja: 設定/更新するプロパティーの名前
ru: Имя свойства для установки / обновления

source: Unsets (clears) the value for the given property
de: Löscht (löscht) den Wert für die angegebene Eigenschaft
ja: 指定プロパティーの値を無効化 (削除)
ru: Unsets (очищает) значение для данного свойства

source: Adds the value(s) to the given property
de: Fügt den/die Wert(e) zu der angegebenen Eigenschaft hinzu
ja: 指定プロパティーに値を追加
ru: Добавляет значение (значения) к данному свойству

source: The name of the property to update
de: Der Name der zu aktualisierenden Eigenschaft
ja: 更新するプロパティーの名前
ru: Имя свойства для обновления

source: Removes the value(s) from the given property
de: Entfernt den/die Wert(e) aus der angegebenen Eigenschaft
ja: 指定プロパティーから値を削除
ru: Удаляет значения (ы) из данного свойства

source: Set the system role to the system syspurpose
ja: システムロールをシステム syspurpose に設定

source: Clear set role
ja: ロールの設定を削除

source: Add addons to the system syspurpose
ja: システム syspurpose にアドオンを追加

source: Remove addons from the system syspurpose
ja: システム syspurpose からアドオンを削除

source: Clear set addons
ja: アドオンの設定を削除

source: Set the system sla
de: Setzen des Systemslaves
ja: システム SLA を設定
ru: Установите системную sla

source: Clear set sla
de: Slaves löschen
ja: SLA の設定を削除
ru: Очистить набор sla

source: Set the system usage
de: Einstellen der Systemnutzung
ja: システムの使用方法を設定
ru: Установка использования системы

source: Clear set usage
ja: 使用方法の設定を削除

source: Show the current system syspurpose
de: Zeigt den aktuellen Systemzweck an
ja: 現行システムの syspurpose を表示
ru: Показать текущую систему syspurpose

source: WARNING: Setting syspurpose in containers has no effect. Please run syspurpose on the host.
ja: 警告: syspurpose をコンテナーに設定しても効果がありません。 syspurpose をホスト上で実行してください。

source: Warning: Unable to sync system purpose with subscription management server: subscription_manager module is not available.
ja: 警告: syspurpose をサブスクリプション管理サーバーと同期できません: subscription_manager モジュールを利用できません。

source: Error: Malformed data in file {}; please review and correct.
ja: エラー: ファイル {} に不正形式のデータがあります; 確認して修正してください。

source: Cannot read syspurpose file {} Are you root?
de: Kann die Mehrzweckdatei nicht lesen {} Sind Sie root?
ja: syspurpose ファイル {} を読み込めません。 root ユーザーでしょうか?
ru: Не удается прочитать файл syspurpose {}. Вы root?

source: Warning: Provided value "{val}" is not included in the list of valid values for attribute {attr}:
ja: 警告: 指定された値 "{val}" は、属性 {attr} の有効な値のリストに含まれていません:

source: Warning: Provided key "{key}" is not included in the list of valid keys:
ja: 警告: 指定された値 "{key}" は有効なキーのリストに含まれていません:

source: User interrupted process
de: Benutzer unterbrochener Prozess
ja: ユーザーによる割り込みプロセス
ru: Пользователь прервал процесс

source: Cannot create directory {} Are you root?
de: Das Verzeichnis kann nicht erstellt werden? Sind Sie root?
ja: ディレクトリー {} を作成できません。 root ユーザーでしょうか?
ru: Не удается создать каталог. {} Вы root?

source: Cannot create file {} Are you root?
de: Datei kann nicht erstellt werden {} Sind Sie root?
ja: ファイル {} を作成できません。 root ユーザーでしょうか?
ru: Невозможно создать файл {} Вы root?

source: Added {} to {}
de: Hinzugefügt {} zu {}
ru: Добавлено {} в {}

source: Removed {} from {}
de: {} aus {} entfernt
ru: Удалено {} из {}

source: {} set to {}
de: {} auf {} gesetzt
ru: {} установлен в {}

source: {} unset
de: {} nicht gesetzt
ru: {} отключить

source: Add one or more offerings to the system syspurpose.
de: Fügen Sie dem Systemsystem ein oder mehrere Angebote hinzu.
ru: Добавьте одно или несколько предложений в систему syspurpose.

source: Remove one or more offerings.
de: Entfernen Sie ein oder mehrere Angebote.
ru: Удалите одно или несколько предложений.

source: Unset all offerings.
de: Alle Angebote aufheben.
ru: Отменить все предложения.

source: Clear set usage/
de: Eindeutige Setverwendung /
ru: Четкое использование /

source: WARNING: Setting syspurpose in containers has no effect.Please run syspurpose on the host.
de: WARNUNG: Das Setzen von syspurpose in Containern hat keine Auswirkung, bitte führen Sie syspurpose auf dem Host aus.
ru: ПРЕДУПРЕЖДЕНИЕ. Установка syspurpose в контейнерах не имеет эффекта. Запустите syspurpose на хосте.
